# Taps
# Only keep the non-standard tap
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'jq'
brew 'grep'
brew 'httpie'
brew 'mas'
brew 'doctl'
brew 'libpq'
brew 'hub'
brew 'ncdu'
brew 'zsh-autosuggestions'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'codex'
brew 'mackup'

# Development
brew 'composer'
brew 'node'
brew 'yarn'

# Apps
cask 'nikitabobko/tap/aerospace'
cask '1password'
cask 'bartender'
cask 'brave-browser'
cask 'cleanshot'
cask 'firefox'
cask 'gifox'
cask 'google-chrome'
cask 'logi-options-plus'
cask 'herd'
cask 'imageoptim'
cask 'hyper'
cask 'iterm2'
cask 'notion'
cask 'chatgpt'
cask 'claude'
cask 'cursor'
cask 'phpstorm'
cask 'jetbrains-toolbox'
cask 'ray'
cask 'raycast'
cask 'screenflow'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'vlc'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-bitter'
