# Taps
# Only keep the non-standard tap
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'antigen' # ZSH plugin bundler
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'chezmoi'
brew 'coreutils' # Those that come with macOS are outdated
brew 'dockutil'
brew 'doctl'
brew 'hub'
brew 'gh'
brew 'git'
brew 'gpgconf'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'libpq'
brew 'mas'
brew 'ncdu'
brew 'nvm'
brew 'starship'
brew 'tldr'
brew 'zsh-autosuggestions'
brew 'pkg-config'

# Development
brew 'zsh'
brew 'composer'
brew 'node'
brew 'yarn'
brew 'postgresql@16'

# Apps - Dev
cask 'cursor'
cask 'docker'
cask 'gpg-suite'
cask 'herd'
cask 'jetbrains-toolbox'
cask 'orbstack'
cask 'phpstorm'
cask 'postico'
cask 'tableplus'
cask 'tinkerwell'
cask 'tuple'
cask 'warp'

# Apps - Productivity
cask 'chatgpt'
cask 'helium-browser'
cask 'logi-options+'
cask 'monitorcontrol'
cask 'notion'
cask 'notion-calendar'
cask 'raycast'
cask 'slack'
cask '1password'

# Fonts
cask 'font-ibm-plex'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-bitter'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto-mono-nerd-font'
